class Note {
  int id;
  String title;
  String content;
  DateTime modifiedTime;

  Note({
    required this.id,
    required this.title,
    required this.content,
    required this.modifiedTime,
  });
}

List<Note> sampleNotes = [
  Note(
    id: 0,
    title: 'Программирование',
    content:
        'Программирование — это создание инструкций для компьютера, то есть программ. Обычно оно выглядит как написание программного кода на каком-нибудь языке программирования. С его помощью разработчики создают сайты, приложения и разнообразные цифровые сервисы.',
    modifiedTime: DateTime(2022, 1, 1, 34, 5),
  ),
  Note(
    id: 1,
    title: 'Веб Разработка',
    content:
        'Frontend переводится с английского языка как «внешний интерфейс», backend — «серверная часть». Фронтенд — «лицо» системы; инструменты и компоненты, которые позволяют пользователю взаимодействовать с сайтом.',
    modifiedTime: DateTime(2022, 1, 1, 34, 5),
  ),
  Note(
    id: 2,
    title: 'База данных',
    content:
        'Backend — это внутренняя часть продукта, которая находится на сервере и скрыта от пользователей. Для ее разработки могут использоваться самые разные языки, например, Python, PHP, Go, JavaScript, Java, С#.',
    modifiedTime: DateTime(2023, 3, 1, 19, 5),
  ),
  Note(
    id: 3,
    title: 'Приложение',
    content:
        'Приложение — это второстепенный член предложения, который даёт другое название предмету и обозначает свойства, качества, родовые признаки определяемого слова, что делает его похожим на определение.',
    modifiedTime: DateTime(2023, 1, 4, 16, 53),
  ),
  Note(
    id: 4,
    title: 'Алгоритм',
    content:
        'Алгоритм — это четкая последовательность действий, выполнение которой дает какой-то заранее известный результат. Проще говоря, это набор инструкций для конкретной задачи. Известнее всего этот термин в информатике и компьютерных науках, где под ним понимают инструкции для решения задачи эффективным',
    modifiedTime: DateTime(2023, 5, 1, 11, 6),
  ),
  Note(
    id: 5,
    title: 'Наука',
    content:
        'Определение: Наука — это особый вид познавательной деятельности человека, направленный на получение, обоснование и систематизацию объективных знаний о мире, человеке, обществе и самом познании, на основе которых происходит преобразование человеком действительности.',
    modifiedTime: DateTime(2023, 1, 6, 13, 9),
  ),
  Note(
    id: 6,
    title: 'Интернет',
    content:
        "К существенным плюсам пользования интернетом можно отнести: Возможность общения в режиме реального времени. Упрощение бытовых дел. Покупку продуктов и оплату счетов можно осуществлять, не выходя из дома. Возможность профессиональной реализации для интровертов.",
    modifiedTime: DateTime(2023, 3, 7, 11, 12),
  ),
  Note(
    id: 7,
    title: 'Математика',
    content:
        'Математика изучает воображаемые, идеальные объекты и соотношения между ними, используя формальный язык. В общем случае математические понятия и теоремы не обязательно имеют соответствие чему-либо в физическом мире.',
    modifiedTime: DateTime(2023, 2, 1, 15, 14),
  ),
  Note(
    id: 8,
    title: 'Физика',
    content:
        'Физика исследует следующие виды явлений: механические (например, почему торможение автомобиля на мокрой дороге является опасным), электрические (например, почему «искрит» соединение проводов), магнитные (например, почему Земля является большим магнитом), световые (например, почему молния сопровождается вспышками), ...',
    modifiedTime: DateTime(2023, 2, 1, 12, 34),
  ),
];
